Dlubal.RFEM5.SlopeDimension
Slope dimension parameters

Dlubal.RFEM5.SlopeDimension.No
Number

Dlubal.RFEM5.SlopeDimension.ID
Identifier

Dlubal.RFEM5.SlopeDimension.Tag
Tag

Dlubal.RFEM5.SlopeDimension.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.SlopeDimension.LineNo
Line number

Dlubal.RFEM5.SlopeDimension.Plane
Dimension plane

Dlubal.RFEM5.SlopeDimension.Direction
Dimension direction

Dlubal.RFEM5.SlopeDimension.Offset
Offset

Dlubal.RFEM5.SlopeDimension.Angle
Angle (read only)

Dlubal.RFEM5.SlopeDimension.Symbol
Symbol